In [173]:
import pandas as pd
import numpy as np

# Creating a dataframe from an array

In [103]:
# array

data = np.array([[1,6], [3,4], [2,3]])

In [104]:
# DataFrame

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
             columns=['col1', 'col2'])

In [105]:
df

      col1  col2
row1     1     6
row2     3     4
row3     2     3

In [106]:
data = [[1,6], [3,4], [2,3]]
data

[[1, 6], [3, 4], [2, 3]]

In [107]:
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
             columns=['col1', 'col2'])

In [108]:
df

      col1  col2
row1     1     6
row2     3     4
row3     2     3

In [109]:
Bundesländer = ['NRW', 'Bayern', 'Hessen', 'Sachsen']
Einwohnerzahl = [17925570, 13140183, 6293154, 4056941]

In [110]:
dict_Bundesländer = {'Bundesländer': Bundesländer, 'Einwohnerzahl': Einwohnerzahl}

In [111]:
dict_Bundesländer

{'Bundesländer': ['NRW', 'Bayern', 'Hessen', 'Sachsen'],
 'Einwohnerzahl': [17925570, 13140183, 6293154, 4056941]}

In [112]:
df_Einwohnerzahl = pd.DataFrame(dict_Bundesländer)

In [113]:
df_Einwohnerzahl

  Bundesländer  Einwohnerzahl
0          NRW       17925570
1       Bayern       13140183
2       Hessen        6293154
3      Sachsen        4056941

# Dataframe from csv

In [114]:
df_Arbeit = pd.read_csv('StudentsPerformance.csv')

In [115]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [116]:
df_Arbeit.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [117]:
df_Arbeit.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [118]:
df_Arbeit.shape

(1000, 8)

In [119]:
pd.set_option('display.max_rows', 1000)

# Attributes

In [120]:
df_Arbeit.index

RangeIndex(start=0, stop=1000, step=1)

In [121]:
df_Arbeit.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [122]:
df_Arbeit.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

# Methods

In [123]:
df_Arbeit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [124]:
df_Arbeit.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

# Function

In [125]:
len(df_Arbeit)

1000

In [126]:
max(df_Arbeit.index)

999

In [127]:
min(df_Arbeit.index)

0

In [128]:
type(df_Arbeit)

pandas.core.frame.DataFrame

In [129]:
round(df_Arbeit, 2).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Select one Column

In [130]:
df_Arbeit['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [131]:
type(df_Arbeit['gender'].head())

pandas.core.series.Series

In [132]:
df_Arbeit['gender'].index

RangeIndex(start=0, stop=1000, step=1)

# Syntax

In [133]:
df_Arbeit.gender.head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [134]:
df_Arbeit['math score'].head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64

# Multiple Column

In [135]:
df_Arbeit[['gender', 'math score']].head()

   gender  math score
0  female          72
1  female          69
2  female          90
3    male          47
4    male          76

In [136]:
type(df_Arbeit[['gender', 'math score']].head())

pandas.core.frame.DataFrame

In [137]:
df_Arbeit[['math score', 'reading score', 'writing score']].head()

   math score  reading score  writing score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

# Add Column

In [138]:
df_Arbeit['Rechtschreibung'] = 70

In [139]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70

In [140]:
Rechtschreibung = np.arange(0, 1000)

In [141]:
len(Rechtschreibung)

1000

In [142]:
df_Arbeit['Rechtschreibung'] = Rechtschreibung
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4

In [143]:
Rechtschreibung_2 = np.random.randint(1, 100, size=1000)

In [144]:
df_Arbeit['Rechtschreibung'] = Rechtschreibung_2
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,36
1,female,group C,some college,standard,completed,69,90,88,54
2,female,group B,master's degree,standard,none,90,95,93,19
3,male,group A,associate's degree,free/reduced,none,47,57,44,60
4,male,group C,some college,standard,none,76,78,75,27

# Math Operations

In [146]:
df_Arbeit['math score'].sum()

66089

In [147]:
print(df_Arbeit['math score'].count())
print(df_Arbeit['math score'].mean())
print(df_Arbeit['math score'].std())
print(df_Arbeit['math score'].max())
print(df_Arbeit['math score'].min())

1000
66.089
15.16308009600945
100
0

In [148]:
df_Arbeit.describe()

       math score  reading score  writing score  Rechtschreibung
count  1000.00000    1000.000000    1000.000000      1000.000000
mean     66.08900      69.169000      68.054000        50.266000
std      15.16308      14.600192      15.195657        28.527725
min       0.00000      17.000000      10.000000         1.000000
25%      57.00000      59.000000      57.750000        26.000000
50%      66.00000      70.000000      69.000000        51.000000
75%      77.00000      79.000000      79.000000        75.000000
max     100.00000     100.000000     100.000000        99.000000

In [149]:
(df_Arbeit['math score'] + df_Arbeit['reading score'] + df_Arbeit['writing score']).head()

0    218
1    247
2    278
3    148
4    229
dtype: int64

In [150]:
df_Arbeit['Durchschnittliches ergebniss'] = (df_Arbeit['math score'] + df_Arbeit['reading score'] + df_Arbeit['writing score'])/3

In [151]:
df_Arbeit.head().round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
0,female,group B,bachelor's degree,standard,none,72,72,74,36,72.67
1,female,group C,some college,standard,completed,69,90,88,54,82.33
2,female,group B,master's degree,standard,none,90,95,93,19,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,60,49.33
4,male,group C,some college,standard,none,76,78,75,27,76.33

# Value Counts

In [152]:
len(df_Arbeit['gender'])

1000

In [153]:
df_Arbeit['gender'].count()

1000

In [154]:
df_Arbeit['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [155]:
df_Arbeit['gender'].value_counts(normalize=True)

female    0.518
male      0.482
Name: gender, dtype: float64

In [156]:
df_Arbeit['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [157]:
df_Arbeit['parental level of education'].value_counts(normalize=True).round(2)

some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: parental level of education, dtype: float64

# Sort DataFrame

In [158]:
df_Arbeit.sort_values(by='math score', ascending=False).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
962,female,group E,associate's degree,standard,none,100,100,100,8,100.000000
625,male,group D,some college,standard,completed,100,97,99,84,98.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,80,100.000000
623,male,group A,some college,standard,completed,100,96,86,31,94.000000
451,female,group E,some college,standard,none,100,92,97,65,96.333333

In [159]:
df_Arbeit.sort_values(['math score', 'reading score', 'writing score'] , ascending=False).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
458,female,group E,bachelor's degree,standard,none,100,100,100,80,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,27,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,8,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,89,97.666667
625,male,group D,some college,standard,completed,100,97,99,84,98.666667

In [160]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
0,female,group B,bachelor's degree,standard,none,72,72,74,36,72.666667
1,female,group C,some college,standard,completed,69,90,88,54,82.333333
2,female,group B,master's degree,standard,none,90,95,93,19,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,60,49.333333
4,male,group C,some college,standard,none,76,78,75,27,76.333333

In [161]:
df_Arbeit.sort_values(['math score', 'reading score', 'writing score'] , ascending=False,
                      inplace=True)

In [162]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
458,female,group E,bachelor's degree,standard,none,100,100,100,80,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,27,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,8,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,89,97.666667
625,male,group D,some college,standard,completed,100,97,99,84,98.666667

In [182]:
df_Arbeit.sort_values('race/ethnicity', ascending=True).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
688,male,group A,high school,free/reduced,none,53,58,44,7,51.666667
365,male,group A,bachelor's degree,free/reduced,completed,49,58,60,65,55.666667
769,male,group A,some college,free/reduced,none,58,60,57,53,58.333333
490,female,group A,associate's degree,free/reduced,none,65,85,76,56,75.333333
820,female,group A,some high school,standard,completed,85,90,92,56,89.000000